_Rarzrabotki/Kazna/DataProcessors/МастерУправленияПодразделениями.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>МастерУправленияПодразделениями</Name>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Ответственные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответственный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/ИдентификацияВизирующихПоРолям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ИдентификацияВизирующихПоРолям</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Переадресация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПереадресацияДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переадресант</Name>
					<Comment>ИО пользователя на данной роли</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Роль</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиВизирования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/InformationRegisters/НастройкиДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>НастройкиДоступа</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Чтение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Запись</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидНаследованияПравДоступаИерархическихСправочников</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНаследованияПравДоступаИерархическихСправочников</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ОбъектДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВладелецПравДоступа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаследованОтВсеПользователи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъектаДоступа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовДоступа</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыОбъектовДоступа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОбъектовДоступа</Name>
			<Comment>//Пока не используется</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БанковскиеСчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кассы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыНаследованияПравДоступаИерархическихСправочников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыНаследованияПравДоступаИерархическихСправочников</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РаспространитьНаПодчиненных</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТолькоДляТекущегоПрава</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаследуетсяОтРодителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УнаследованоОтДочернего</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/Enums/ВидыАдресацийРолейВизирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыАдресацийРолейВизирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоПодразделению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоОрганизации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоНаправлению</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Kazna/DataProcessors/МастерУправленияПодразделениями/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура СоздатьОбновитьПодразделениеНаСервере()
	// Вставить содержимое обработчика.
	ЕстьОшибки = Ложь;
	Если НЕ ЗначениеЗаполнено(НаименоованиеПодразделения) Тогда
		Сообщить("Не заполнено наименование");
		ЕстьОшибки = Истина;
	КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(СхемаВизированияБезНал) Тогда
	//	Сообщить("Не заполнена схема взирования");
	//	ЕстьОшибки = Истина;
	//КонецЕсли;
	//Если НЕ ЗначениеЗаполнено(СхемаВизированияНал) Тогда
	//	Сообщить("Не заполнена схема взирования");
	//	ЕстьОшибки = Истина;
	//КонецЕсли;

	Для каждого Стр Из Объект.Ответственные Цикл
		Если НЕ ЗначениеЗаполнено(Стр.Ответственный) Тогда
			 Сообщить("Не заполнен ответственный для роли "+СТр.Роль);
			ЕстьОшибки = Истина;
		КонецЕсли;
	КонецЦикла;
	Если ЕстьОшибки Тогда
		Возврат;
	КонецЕсли;
	
	
	СпрПодр = Справочники.Подразделения.НайтиПоНаименованию(НаименоованиеПодразделения);
	Если СпрПодр.Пустая() Тогда
		СпрПодр= Справочники.Подразделения.СоздатьЭлемент();
		
		СпрПодр.Наименование=НаименоованиеПодразделения;
		//прПодр.Родитель=Справочники.Подразделения.НайтиПоКоду("");
		СпрПодр.Актуальное=Истина;
		СпрПодр.Записать();
		
		СпрПодр=СпрПодр.Ссылка;
		Сообщить("Создали подразделение "+ НаименоованиеПодразделения);
	КонецЕсли;
	
	
	СпрГП=Справочники.ГруппыПользователей.НайтиПоНаименованию(НаименоованиеПодразделения);
	Если СпрГП.Пустая() Тогда
		СпрГП= Справочники.ГруппыПользователей.СоздатьЭлемент();
		
		СпрГП.Наименование=НаименоованиеПодразделения;
		СпрГП.Родитель=Справочники.ГруппыПользователей.НайтиПоНаименованию("INDUSTRIAL");
		СпрГП.Записать();
		
		СпрГП=СпрГП.Ссылка;
		Сообщить("Создали группу пользователей "+ НаименоованиеПодразделения);
	КонецЕсли;

	//Рег = РегистрыСведений.ОпределениеСхемыВизированияПоСчетам.СоздатьМенеджерЗаписи();
	//Рег.ВидОплаты=Перечисления.ВидыДенежныхСредств.Наличные;
	//Рег.Подразделение=СпрПодр.Ссылка;
	//Рег.СхемаВизирования=СхемаВизированияНал;
	//Рег.Организация=Справочники.Организации.НайтиПоКоду("000000058");
	//Рег.Записать();
	//Сообщить("Добавили схему визирования "+ СхемаВизированияНал);
	//
	//Рег = РегистрыСведений.ОпределениеСхемыВизированияПоСчетам.СоздатьМенеджерЗаписи();
	//Рег.ВидОплаты=Перечисления.ВидыДенежныхСредств.Безналичные;
	//Рег.Подразделение=СпрПодр.Ссылка;
	//Рег.СхемаВизирования=СхемаВизированияБезНал;
	//Рег.Организация=Справочники.Организации.НайтиПоКоду("000000058");
	//Рег.Записать();
	//Сообщить("Добавили схему визирования "+ СхемаВизированияБезНал);

	
	Для каждого Стр Из Объект.Ответственные Цикл
		Рег= РегистрыСведений.ИдентификацияВизирующихПоРолям.СоздатьМенеджерЗаписи();
		Рег.Объект=СпрПодр.Ссылка;
		Рег.Роль=Стр.Роль;
		Рег.Пользователь=Стр.Ответственный;
		Рег.Записать();
		Сообщить("Добавили роль "+ Стр.Роль+" "+Стр.Ответственный);
	КонецЦикла;
	
	//Настройки доступа
	Рег = РегистрыСведений.НастройкиДоступа.СоздатьМенеджерЗаписи();
	Рег.ОбъектДоступа= СпрПодр.Ссылка;
	Рег.ВладелецПравДоступа=СпрПодр.Ссылка;
	Рег.Пользователь= СпрГП.Ссылка;
	Рег.ВидОбъектаДоступа= Перечисления.ВидыОбъектовДоступа.Подразделения;
	
	Рег.Чтение=Истина;
	Рег.Запись=Истина;
	
	Рег.ВидНаследованияПравДоступаИерархическихСправочников=Перечисления.ВидыНаследованияПравДоступаИерархическихСправочников.РаспространитьНаПодчиненных;
	Рег.Записать();
	Сообщить("Добавили настройку доступа "+ СпрПодр.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьОбновитьПодразделение(Команда)
	СоздатьОбновитьПодразделениеНаСервере();
КонецПроцедуры

&НаСервере
Процедура СхемаВизированияНалПриИзмененииНаСервере()
	Если ЗначениеЗаполнено(СхемаВизированияНал) Тогда
		Для каждого Стр Из СхемаВизированияНал.Роли Цикл
			Если Стр.Роль.ВидАдресации=Перечисления.ВидыАдресацийРолейВизирования.ПоПодразделению Тогда
				Если Объект.Ответственные.НайтиСтроки(Новый Структура("Роль",Стр.Роль)).Количество()=0 Тогда
					нСТр =Объект.Ответственные.Добавить(); 
					нСТр.роль=Стр.Роль;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СхемаВизированияБезНал) Тогда
		Для каждого Стр Из СхемаВизированияБезНал.Роли Цикл
			Если Стр.Роль.ВидАдресации=Перечисления.ВидыАдресацийРолейВизирования.ПоПодразделению Тогда
			Если Объект.Ответственные.НайтиСтроки(Новый Структура("Роль",Стр.Роль)).Количество()=0 Тогда
				нСТр =Объект.Ответственные.Добавить(); 
				нСТр.роль=Стр.Роль;
			КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СхемаВизированияНалПриИзменении(Элемент)
	СхемаВизированияНалПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура СхемаВизированияБезНалПриИзменении(Элемент)
	СхемаВизированияНалПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДоступНаСервере()
	СпрГП = ГруппаПользователей.ПолучитьОбъект();
	СпрГП.Состав.Очистить();
	Для каждого СТр Из ПользователиПодразделения Цикл
		нСтр  =    СпрГП.Состав.Добавить();
		нСтр  .Пользователь=  СТр.Значение;
	КонецЦикла;
	
	СпрГП.Записать();
	Сообщить("Обновление завершено");
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступ(Команда)
	ОбновитьДоступНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТекПодразделениеПриИзмененииНаСервере()
	//Сообщить("нвава");
	ПользователиПодразделения.Очистить();
	Для каждого СТр Из ГруппаПользователей.Состав Цикл
		нСтр = ПользователиПодразделения.Добавить(Стр.Пользователь);
		//Сообщить("Добавили "+Стр.Пользователь);
	КонецЦикла;
	//ЭтаФорма.Элементы.обно
КонецПроцедуры

&НаКлиенте
Процедура ТекПодразделениеПриИзменении(Элемент)
	ТекПодразделениеПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаПользователейПриИзменении(Элемент)
	ТекПодразделениеПриИзмененииНаСервере()

КонецПроцедуры

&НаСервере
Процедура НаименоованиеПодразделенияПриИзмененииНаСервере()
	рольПМ = Справочники.РолиВизирования.НайтиПоКоду(37);              
	СтрокиПМ = Объект.Ответственные.НайтиСтроки(Новый Структура("Роль",рольПМ));
	Если СтрокиПМ.Количество()=0 Тогда
		нСТр = 	                            	Объект.Ответственные.Добавить();
		нСТр .роль= рольПМ ;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НаименоованиеПодразделенияПриИзменении(Элемент)
	НаименоованиеПодразделенияПриИзмененииНаСервере();
КонецПроцедуры
